#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include "park.h"

void welcome()
{
	system("clear");

	printf("#######################################################\n");
	printf("#######################################################\n");
	printf("#######################################################\n\n");

	printf("\t\t欢迎使用停车管理系统\n\n");

	printf("######################################################\n");
	printf("######################################################\n");
	printf("######################################################\n");

	sleep(1);
}

void menu()
{
	system("clear");

	printf("#######################################################\n");
	printf("#######################################################\n");
	printf("#######################################################\n\n");

	printf("\t\t 1、查看停车场情况\n");
	printf("\t\t 2、停车\n");
	printf("\t\t 3、离开\n\n");

	printf("\t\t请选择 ...\n");

	printf("######################################################\n");
	printf("######################################################\n");
	printf("######################################################\n");
		
}

void print_array(int array[ROW][COLUMN])
{
	int i, j;
	for (i = 0; i < ROW; i++)
	{
		for (j = 0; j < COLUMN; j++)
		{
			if (array[i][j] == WAY)
			{
				printf("-  ");
			}
			else if (array[i][j] == CAR)
			{
				printf("#  ");
			}
			else if (array[i][j] == CAREXIST)
			{
				printf("\033[0;31m#  \033[0m");
			}
			else if (array[i][j] == PATH)
			{
				printf("\033[0;31m-  \033[0m");
			}
		}
		printf("\n\n");
	}

	getchar();
	getchar();
}
